package ru.rougsig.ambercard.helpers

/**
 * Created by rougs on 11-Oct-17.
 */
object RawJson {
    val ab_one = "{\n" +
            "  \"id\": 26,\n" +
            "  \"name\": \"ЮБИЛЕЙНЫЙ МОСТ\",\n" +
            "  \"category_id\": [\n" +
            "    {\n" +
            "      \"id\": 5,\n" +
            "      \"name\": \"Маршрут \\\"Места для поцелуев\\\"\",\n" +
            "      \"icon\": \"/media/depositphotos_115049264-stock-illustration-couple-in-love-sketch-icon.jpg\",\n" +
            "      \"picture\": \"/media/route_kissing_places.jpg\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"description\": \"Юбилейный мост — пешеходный разводной мост через реку Преголю в Калининграде. Мост назван так потому что его открытие, состоявшееся 1 июля 2005 года, было приурочено к 750-летнему юбилею города. Мост соедняет улицы Октябрьская и Эпроновская. Мост входит в состав комплекса Рыбная деревня. Автор проекта моста — архитектор Александр Башин.\\r\\nМост построен на опорах разрушенного во время войны Императорского моста.\",\n" +
            "  \"description_2\": \"\",\n" +
            "  \"latitude\": 54.702407,\n" +
            "  \"longitude\": 20.51451,\n" +
            "  \"rate\": \"5\",\n" +
            "  \"cost_sum\": \"\",\n" +
            "  \"cost_text\": \"\",\n" +
            "  \"phone\": \"\",\n" +
            "  \"site\": \"\",\n" +
            "  \"discount_min\": \"0\",\n" +
            "  \"discount_max\": \"0\",\n" +
            "  \"discount_conditions\": \"Мост бесплатен для посещения\",\n" +
            "  \"min_people\": null,\n" +
            "  \"max_people\": null,\n" +
            "  \"photos\": [\n" +
            "    \"/media/jubelee_brigde.jpg\"\n" +
            "  ]\n" +
            "}"

    val ab_two = "{\n" +
            "  \"id\": 1,\n" +
            "  \"name\": \"МУЗЕЙ-КВАРТИРА ALTES HAUS — HUFEN\",\n" +
            "  \"category_id\": [\n" +
            "    {\n" +
            "      \"id\": 1,\n" +
            "      \"name\": \"Музеи\",\n" +
            "      \"icon\": \"/media/ic_museum.png\",\n" +
            "      \"picture\": \"/media/unnamed.jpg\"\n" +
            "    }\n" +
            "  ],\n" +
            "  \"description\": \"Музей показывает обстановку семейного быта семьи Густава Гросманна, купца и владельца продовольственного магазина и рассказывает историю городского района Хуфен. Здание на Шрёттерштрассе 11-13 было построено в 1912 году под доходный дом.\\r\\n\\r\\nМы вместе прогуляемся по району Хуфен, узнаем историю доходных домов по улице Шрётерштрассе, где расположен дом герра Гроссмана, рассмотрим предметы мужского обихода: головные уборы, обувь, курительные трубки и аксессуары для курения, костюмы той эпохи. Загляните в Altes Haus — Hufen, чтобы увидеть, чем жили мужчины Кёнигсберга на рубеже XIX и ХХ веков.\\r\\n\\r\\nКвартира используется как место для встреч, интересных собраний, лекций и, конечно же, экскурсий.\",\n" +
            "  \"description_2\": \"Экскурсии с понедельника по субботу в  11.00, 13.00 и 15.00. Продолжительность экскурсии — 1-1,5 ч.\",\n" +
            "  \"latitude\": 54.722104,\n" +
            "  \"longitude\": 20.474408,\n" +
            "  \"rate\": \"5\",\n" +
            "  \"cost_sum\": \"300\",\n" +
            "  \"cost_text\": \"Стоимость входного билета\",\n" +
            "  \"phone\": \"+7 (4012) 33 50 60\",\n" +
            "  \"site\": \"http://alteshaus.ru/\",\n" +
            "  \"discount_min\": \"10\",\n" +
            "  \"discount_max\": \"10\",\n" +
            "  \"discount_conditions\": \"Скидка на входной билет и на поездки, организованные музеем\",\n" +
            "  \"min_people\": 1,\n" +
            "  \"photos\": [\n" +
            "    \"/media/alterhaus_01.jpg\",\n" +
            "    \"/media/alterhaus_02.jpg\",\n" +
            "    \"/media/alterhaus_03.jpg\",\n" +
            "    \"/media/alterhaus_04.jpg\",\n" +
            "    \"/media/alterhaus_05.jpg\"\n" +
            "  ]\n" +
            "}"
}